-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 08, 2024 at 05:16 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `admin_sds`
--

-- --------------------------------------------------------

--
-- Table structure for table `subjects`
--

CREATE TABLE `subjects` (
  `SubjectID` int(11) NOT NULL,
  `SubjectCode` varchar(20) NOT NULL,
  `SubjectName` varchar(100) NOT NULL,
  `CreditHours` int(2) NOT NULL,
  `CurriculumYear` year(4) NOT NULL,
  `TheoryHours` int(2) NOT NULL,
  `PracticalHours` int(2) NOT NULL,
  `DepartmentID` int(11) DEFAULT NULL,
  `SubjectType` enum('ทฤษฎี','ปฏิบัติ','กิจกรรม','สถานประกอบการ') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `subjects`
--

INSERT INTO `subjects` (`SubjectID`, `SubjectCode`, `SubjectName`, `CreditHours`, `CurriculumYear`, `TheoryHours`, `PracticalHours`, `DepartmentID`, `SubjectType`) VALUES
(71, '20001-1003', 'ธุรกิจเบื้องต้น', 2, '2024', 1, 2, 10, 'ทฤษฎี'),
(72, '21910-1002', 'วิเคราะห์ความต้องการทางธุรกิจ', 2, '2024', 1, 2, 10, 'ทฤษฎี'),
(73, '21910-1003', 'การเขียนโปรแกรมคอมพิวเตอร์เบื้องต้น', 2, '2024', 1, 2, 10, 'ปฏิบัติ'),
(74, '21910-1004', 'พาณิชย์อิเล็กทรอนิกส์เบื้องต้น', 2, '2024', 1, 2, 10, 'ปฏิบัติ'),
(75, '21910-2007', 'โปรแกรมกราฟิกเพื่อสร้างสื่อดิจิทัล', 3, '2024', 2, 2, 10, 'ปฏิบัติ'),
(76, '21910-2009', 'คณิตศาสตร์คอมพิวเตอร์', 2, '2024', 1, 2, 10, 'ทฤษฎี'),
(77, '21910-2010', 'การเขียนโปรแกรมภาษาคอมพิวเตอร์', 3, '2024', 2, 2, 10, 'ปฏิบัติ'),
(78, '20000-2002', 'กิจกรรมลูกเสือวิสามัญ 2', 0, '2024', 0, 2, 10, 'กิจกรรม'),
(79, '20001-1005', 'กฏหมายพาณิชย์', 2, '2019', 2, 0, 10, 'ทฤษฎี'),
(80, '20204-2004', 'หลักการเขียนโปรแกรม', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(81, '20204-2006', 'องค์ประกอบศิลป์สำหรับงานคอมพิวเตอร์', 2, '2019', 1, 2, 10, 'ปฏิบัติ'),
(82, '20204-2008', 'การสร้างเว็บไซต์', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(83, '20204-2108', 'การเขียนโปรแกรมเชิงวัตถุเบื้องต้น', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(84, '20204-2109', 'การผลิตสื่อสิ่งพิมพ์', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(85, '20000-2004', 'กิจกรรมองค์การวิชาชีพ 2', 0, '2019', 0, 2, 10, 'กิจกรรม'),
(86, '20204-2106', 'โปรแกรมสำเร็จรูปทางสถิติ', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(87, '20204-8501', 'โครงงาน', 4, '2019', 0, 4, 10, 'ปฏิบัติ'),
(88, '20204-2110', 'โปรแกรมมัลติมีเดีย', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(89, '20204-2111', 'โปรแกรมสร้างภาพเคลื่อนไหว', 3, '2019', 2, 2, 10, 'ปฏิบัติ'),
(90, '31910-2001', 'การบริหารจัดการความต้องการทางธุรกิจ', 3, '2024', 2, 2, 10, 'สถานประกอบการ'),
(91, '31910-2015', 'การออกแบบสื่อดิจิทัล', 3, '2024', 2, 2, 10, 'สถานประกอบการ'),
(92, '31910-2023', 'การบำรุงรักษาคอมพิวเตอร์และอุปกรณ์พกพา', 3, '2024', 2, 2, 10, 'สถานประกอบการ'),
(93, '31910-2006', 'การสร้างแบรนด์ธุรกิจดิจิทัล', 3, '2024', 2, 2, 10, 'สถานประกอบการ'),
(94, '30000-2005', 'กิจกรรมในสถานประกอบการ 1', 0, '2024', 0, 2, 10, 'สถานประกอบการ'),
(95, '30001-1055', 'กฏหมายธุรกิจ', 3, '2021', 3, 0, 10, 'ทฤษฎี'),
(96, '30200-1002', 'หลักการตลาด', 3, '2021', 2, 2, 10, 'ทฤษฎี'),
(97, '30204-2001', 'พื้นฐานธุรกิจดิจิทัล', 3, '2021', 2, 2, 10, 'ทฤษฎี'),
(98, '30204-2004', 'หลักการคิดเชิงออกแบบและนวัตกรรมธุรกิจฯ', 3, '2021', 2, 2, 10, 'ทฤษฎี'),
(99, '30204-2005', 'การเขียนโปรแกรมคอมพิวเตอร์', 3, '2021', 2, 2, 10, 'ปฏิบัติ'),
(100, '30204-2006', 'การสร้างแบรนด์ธุรกิจดิจิทัล', 3, '2021', 2, 2, 10, 'ทฤษฎี'),
(101, '30204-2007', 'เครือข่ายคอมพิวเตอร์และความปลอดภัยสำหรับธุรกิจฯ', 3, '2021', 2, 2, 10, 'ปฏิบัติ'),
(102, '30204-8501', 'โครงงาน', 4, '2021', 0, 4, 10, 'ปฏิบัติ'),
(103, '20000-2007', 'กิจกรรมส่งเสริมคุณธรรม จริยธรรม', 0, '2021', 0, 2, 10, 'กิจกรรม'),
(104, '30204-2303', 'การพัฒนาโปรแกรมบนอุปกรณ์เคลื่อนที่แบบพกพา', 3, '2021', 2, 2, 10, 'ปฏิบัติ'),
(105, '30204-2204', 'การผลิตสื่อมัลติมีเดียสำหรับธุรกิจดิจิทัล', 3, '2021', 2, 2, 10, 'ปฏิบัติ'),
(106, '20000-1102', 'ภาษาไทยเพื่ออาชีพ', 1, '2024', 0, 2, 11, 'ทฤษฎี'),
(107, '20000-1203', 'การฟังและการพูดภาษาอังกฤษ', 1, '2024', 0, 2, 11, 'ทฤษฎี'),
(108, '20000-1402', 'คณิตศาสตร์อุตสาหกรรม', 2, '2024', 2, 0, 11, 'ทฤษฎี'),
(109, '20000-1602', 'เพศวิถีศึกษา', 1, '2024', 1, 0, 11, 'ทฤษฎี'),
(110, '20000-1603', 'พลศึกษาเพื่อพัฒนาสุขภาพ', 1, '2024', 0, 2, 11, 'ทฤษฎี'),
(111, '20000-1205', 'ภาษาอังกฤษสถานประกอบการ', 1, '2019', 0, 2, 11, 'ทฤษฎี'),
(112, '20000-1210', 'ภาษาอังกฤษสำหรับงานธุรกิจ', 1, '2019', 0, 2, 11, 'ทฤษฎี'),
(113, '20000-1208', 'ภาษาอังกฤษเตรียมความพร้อมเพื่อการทำงาน', 1, '2019', 0, 2, 11, 'ทฤษฎี'),
(114, '20000-1404', 'คณิตศาสตร์ธุรกิจบริการ', 2, '2019', 2, 0, 11, 'ทฤษฎี'),
(115, '20000-1502', 'ประวัติศาสตร์ชาติไทย', 1, '2019', 1, 0, 11, 'ทฤษฎี'),
(116, '30000-1214', 'ภาษาอังกฤษเทคโนโลยีสารสนเทศ', 3, '2021', 3, 0, 11, 'ทฤษฎี'),
(117, '30000-1408', 'คณิตศาสตร์ธุรกิจและบริการ', 3, '2021', 3, 0, 11, 'ทฤษฎี'),
(118, '30000-1609', 'ลีลาศเพื่อพัฒนาสุขภาพและบุคลิกภาพ', 1, '2021', 0, 2, 11, 'ทฤษฎี'),
(119, '30000-2005', 'กิจกรรมส่งเสริมคุณธรรม จริยธรรม', 0, '2021', 0, 2, 10, 'กิจกรรม');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`SubjectID`),
  ADD KEY `FK_Subjects_Department` (`DepartmentID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `subjects`
--
ALTER TABLE `subjects`
  MODIFY `SubjectID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=120;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `subjects`
--
ALTER TABLE `subjects`
  ADD CONSTRAINT `FK_Subjects_Department` FOREIGN KEY (`DepartmentID`) REFERENCES `departments` (`DepartmentID`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
