   <!-- Content -->
   <div id="content" class="content container col-12 col-md-9 p-3">
     <h5 class="text-success">ข่าวประชาสัมพันธ์</h5>
     <div class="card mb-3">
       <div class="card-body">
         <h6 class="card-title text-danger">อัปเดตฟีเจอร์ใหม่: การปรับเปลี่ยนตารางเรียนอัตโนมัติ</h6>
         <p class="card-text text-muted small">ระบบสนับสนุนการตัดสินใจในการจัดตารางเรียนได้เพิ่มฟีเจอร์ใหม่
           การปรับเปลี่ยนตารางเรียนอัตโนมัติ เพื่อรองรับการเปลี่ยนแปลงในกรณี:</p>

         <ul>
           <li>ครูผู้สอนไม่สามารถเข้าชั้นเรียนได้</li>
           <li>นักเรียนต้องการเปลี่ยนกลุ่มวิชาเรียน</li>
         </ul>
         <p class="card-text text-muted small">
           ระบบจะช่วยปรับเปลี่ยนตารางเรียนโดยอัตโนมัติและแจ้งเตือนผู้ใช้งานผ่านทางหน้าเว็บไซต์และอีเมล
           ผู้ใช้งานสามารถทดสอบฟีเจอร์ใหม่นี้ได้แล้ววันนี้!</p>
       </div>
     </div>
     <div class="card mb-3">
       <div class="card-body">
         <div class="d-flex justify-content-between">
           <h6 class="card-title text-danger">เปิดตัวระบบสนับสนุนการตัดสินใจในการจัดตารางเรียน</h6>

         </div>
         <p class="card-text text-muted small">ทางวิทยาลัยมีความยินดีที่จะประกาศเปิดตัว
           ระบบสนับสนุนการตัดสินใจในการจัดตารางเรียน
           เพื่อช่วยในการจัดตารางเรียนให้มีประสิทธิภาพและลดปัญหาการชนของตารางเรียนระหว่างวิชาหรือครูผู้สอน
           ระบบนี้ถูกออกแบบมาเพื่อรองรับทั้งครูผู้สอนและนักเรียน โดยมีคุณสมบัติเด่นดังนี้:</p>
         <ul>
           <li>การจัดการเวลาสอนและห้องเรียนที่ง่ายดาย</li>
           <li>การแสดงผลตารางเรียนแบบเรียลไทม์</li>
           <li>การแจ้งเตือนกรณีตารางเรียนชนกัน</li>
         </ul>
         <p class="card-text text-muted small"> ครูและนักเรียนสามารถเข้าสู่ระบบเพื่อทดลองใช้งานได้ที่เว็บไซต์
           ระบบสนับสนุนการตัดสินใจในการจัดตารางเรียน</p>
       </div>
     </div>
   </div>